H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
// Draw one private-code character on tft at (x, y) in the given font.
// setTextColor must be set by the caller before use.  Returns advance width.
static int16_t tftCharUTF8(TFT_eSPI& tft, uint8_t c, int16_t x, int16_t y,
                             uint8_t font, uint16_t color) {
    static const char ubases[] = {'A','a','O','o','U','u'};
    if (c == 0x86)
        return bibleDrawSzlig(tft, x, y, font, color);
    if (c >= 0x80 && c <= 0x85) {
        bool    is_lower = ((c - 0x80) & 1) != 0;
        int16_t adv      = tft.drawChar((uint16_t)(uint8_t)ubases[c - 0x80], x, y, font);
        bibleDrawUmlautDots(tft, x, y, adv, is_lower, font, color);
        return adv;
    }
    return tft.drawChar((uint16_t)c, x, y, font);
}

void BibleInterface::drawListRow(int16_t y_px, const char* text, bool selected, bool has_arrow) {
    uint16_t bg_c  = selected ? sel_bg() : bg();
    uint16_t fg_c  = fg();
    // Right edge: leave room for scrollbar (6px) + arrow (14px) + small gap
    int16_t  max_x = (int16_t)scrW() - (has_arrow ? 28 : 8);
    int16_t  ty    = y_px + (itemH() - 16) / 2;
    tft.fillRect(0, y_px, scrW(), itemH(), bg_c);
    tft.setTextColor(fg_c, bg_c);
    // Draw text char-by-char with private-code umlaut/ß support
    int16_t tx = 10;
    for (const char* p = text; *p && tx < max_x; p++)
        tx += tftCharUTF8(tft, (uint8_t)*p, tx, ty, 2, fg_c);
    if (has_arrow) {
        tft.setTextColor(dim_fg(), bg_c);
        tft.drawString(">", scrW() - 20, ty, 2);
    }
    // divider
    tft.drawFastHLine(0, y_px + itemH() - 1, scrW(), dark_mode ? 0x2104 : 0xC618);
}

void BibleInterface::drawScrollBar(int16_t total, int16_t vis, int16_t top) {
    if (total <= vis) return;
    uint16_t barX = scrW() - 6;
    uint16_t barY = contentY();
    uint16_t barH = contentH();
    tft.fillRect(barX, barY, 6, barH, dark_mode ? 0x2104 : 0xC618);
    int16_t thumbH = max((int16_t)10, (int16_t)(barH * vis / total));
    int16_t thumbY = barY + (int16_t)((int32_t)top * (barH - thumbH) / max(1, total - vis));
    tft.fillRect(barX, thumbY, 6, thumbH, dim_fg());
}

// Redraws only the list content area (rows + scrollbar) without touching the
// header or nav bar.  Called directly during scroll drag/fling so there is no
// full-screen repaint — eliminating the white/black flash between frames.
// Uses scroll_px for sub-item-height pixel accuracy.
// setViewport clips rows that extend into the header or nav bar zones.
// startWrite / endWrite batches all SPI transfers in one transaction for speed.
void BibleInterface::redrawListContent(uint16_t item_count) {
    int16_t sub_px      = (int16_t)fmodf(scroll_px, (float)itemH());
    int16_t first       = (int16_t)(scroll_px / (float)itemH());
    int16_t content_top = (int16_t)contentY();
    int16_t content_end = content_top + (int16_t)contentH();

    tft.startWrite();
    // Clip all draws to the content zone — prevents header/nav bleed without a
    // global clear (which would cause flash). vpDatum=false keeps screen-absolute coords.
    tft.setViewport(0, contentY(), scrW(), contentH(), false);

    int16_t last_bottom = content_top;

    for (int i = 0; ; i++) {
        int16_t idx = first + i;
        int16_t y   = content_top - sub_px + i * (int16_t)itemH();
        if (y >= content_end || idx >= (int16_t)item_count) break;

        switch (view) {
            case BV_TRANS_SELECT:
                drawListRow(y, trans_stems[idx],
                            idx == (int16_t)menu_sel);
                break;
            case BV_SECTION_SELECT:
                if (idx < (int16_t)numSecs())
                    drawListRow(y, secName(idx), idx == (int16_t)menu_sel);
                break;
            case BV_BOOK_SELECT:
                drawListRow(y, bookDisplay(secStart(cur_sec) + idx),
                            idx == (int16_t)menu_sel);
                break;
            case BV_CHAPTER_SELECT:   // Dictionary page list (smooth scroll)
                drawListRow(y, pageLabel(idx), idx == (int16_t)menu_sel, false);
                break;
            case BV_BOOKMARKS:
                drawListRow(y, bookmarks[idx].label,
                            idx == (int16_t)bm_sel, false);
                break;
            case BV_SEARCH_INPUT:
                drawListRow(y, search_hist[idx], idx == (int16_t)search_hist_sel, false);
                break;
            default: break;
        }
        int16_t bot = y + (int16_t)itemH();
        if (bot > last_bottom) last_bottom = bot;
    }

    // Clear any unused space below the last row (list shorter than content zone).
    // Fill full width — the scrollbar will repaint its 6px column when needed.
    if (last_bottom < content_end)
        tft.fillRect(0, last_bottom, scrW(), content_end - last_bottom, bg());

    tft.resetViewport();
    drawScrollBar(item_count, visItems(), first);
    tft.endWrite();
}

// Redraws only the chapter tile grid and scrollbar without touching the header
// or nav bar.  Called directly during scroll drag instead of setting needs_redraw,
// which would trigger a full drawChapterSelect() → fillScreen() → flash next loop.
// startWrite / endWrite batches all SPI transfers in one transaction for speed.
void BibleInterface::redrawChapterContent() {
    uint16_t  chaps      = bookChapters(cur_book);
    uint16_t tile_w     = scrW() / 5;
    uint16_t tile_h     = 36;
    uint8_t  vis_rows   = (uint8_t)(contentH() / tile_h);
    int16_t  total_rows = ((int16_t)chaps + 4) / 5;

    tft.startWrite();
    // Each tile fills its own background; no global clear (prevents flash).
    // Clip to content zone so tiles never bleed into header or nav.
    tft.setViewport(0, contentY(), scrW(), contentH(), false);

    for (uint8_t row = 0; row < vis_rows; row++) {
        for (uint8_t col = 0; col < 5; col++) {
            uint16_t ch = (uint16_t)((menu_scroll + row) * 5 + col + 1);
            uint16_t x = col * tile_w;
            uint16_t y = contentY() + row * tile_h;
            if (ch > chaps) {
                // Clear unused tile slots to the right in the last row
                if (x < scrW() - 6)
                    tft.fillRect(x, y, scrW() - 6 - x, tile_h, bg());
                break;
            }
            bool     sel     = (ch == cur_chapter) || (ch == (int16_t)menu_sel);
            uint16_t tile_bg = sel ? sel_bg() : bg();
            tft.fillRect(x, y, tile_w, tile_h, tile_bg);
            tft.drawRect(x, y, tile_w, tile_h, dark_mode ? 0x2104 : 0xC618);
            char buf[5];
            snprintf(buf, sizeof(buf), "%d", ch);
            tft.setTextColor(fg(), tile_bg);
            tft.drawCentreString(buf, x + tile_w / 2, y + (tile_h - 16) / 2, 2);
        }
    }
    // Clear any gap below the tile rows
    uint16_t used_h = (uint16_t)vis_rows * tile_h;
    if (used_h < contentH())
        tft.fillRect(0, contentY() + used_h, scrW() - 6, contentH() - used_h, bg());

    tft.resetViewport();
    drawScrollBar(total_rows, vis_rows, menu_scroll);
    tft.endWrite();
}

// ─────────────────────────────────────────────────────────────────────────────
// Translation select screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawTransSelect() {
    tft.fillScreen(bg());
    const char* title = (mode == MODE_SONGS) ? "Choose Songbook"
                      : (mode == MODE_DICT)  ? "Choose Dictionary"
                                             : "Choose Translation";
    drawHeader(title, true);
    uint8_t vis = visItems();
    for (uint8_t i = 0; i < vis && (menu_scroll + i) < trans_count; i++) {
        bool sel = (menu_scroll + i) == (int16_t)menu_sel;
        drawListRow(contentY() + i * itemH(), trans_stems[menu_scroll + i], sel);
    }
    drawScrollBar(trans_count, vis, menu_scroll);
    drawNavBar("Marks", "Settings", "Bright");
}

// ─────────────────────────────────────────────────────────────────────────────
// Section select screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawSectionSelect() {
    tft.fillScreen(bg());
    drawHeader(trans_count > 0 ? trans_stems[cur_trans] : "Bible", true);
    // Scroll-aware: Songs can have many categories (sections), so honor menu_scroll
    // and draw a scrollbar (Bible's 4 sections always fit).
    uint8_t vis = visItems();
    for (uint8_t i = 0; i < vis && (menu_scroll + i) < numSecs(); i++) {
        bool sel = (menu_scroll + i) == (int16_t)menu_sel;
        drawListRow(contentY() + i * itemH(), secName(menu_scroll + i), sel);
    }
    drawScrollBar(numSecs(), vis, menu_scroll);
    drawNavBar("Marks", "Settings", "Bright");
}

// ─────────────────────────────────────────────────────────────────────────────
// Book select screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawBookSelect() {
    tft.fillScreen(bg());
    drawHeader(secName(cur_sec));
    uint8_t vis   = visItems();
    uint16_t start = secStart(cur_sec);
    uint16_t count = secLen(cur_sec);
    for (uint8_t i = 0; i < vis && (menu_scroll + i) < count; i++) {
        bool sel = (menu_scroll + i) == (int16_t)menu_sel;
        drawListRow(contentY() + i * itemH(), bookDisplay(start + menu_scroll + i), sel);
    }
    drawScrollBar(count, vis, menu_scroll);
    drawNavBar("Marks", "Settings", "Bright");
}

// ─────────────────────────────────────────────────────────────────────────────
// Chapter select screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawChapterSelect() {
    tft.fillScreen(bg());
    drawHeader(bookDisplay(cur_book));

    // Dictionary: a scrollable list of pages ("firstword - lastword").
    if (mode == MODE_DICT) {
        uint8_t vis = visItems();
        for (uint8_t i = 0; i < vis && (menu_scroll + i) < (int16_t)rt_page_count; i++) {
            bool sel = (menu_scroll + i) == (int16_t)menu_sel;
            drawListRow(contentY() + i * itemH(), pageLabel(menu_scroll + i), sel, false);
        }
        drawScrollBar((int16_t)rt_page_count, vis, menu_scroll);
        drawNavBar("Marks", "Settings", "Bright");
        return;
    }

    uint16_t  chaps    = bookChapters(cur_book);
    uint16_t tile_w   = scrW() / 5;
    uint16_t tile_h   = 36;
    uint8_t  vis_rows = (uint8_t)(contentH() / tile_h);

    for (uint8_t row = 0; row < vis_rows; row++) {
        for (uint8_t col = 0; col < 5; col++) {
            uint16_t ch = (uint16_t)((menu_scroll + row) * 5 + col + 1);
            if (ch > chaps) break;

            uint16_t x  = col * tile_w;
            uint16_t y  = contentY() + row * tile_h;
            bool     sel = (ch == cur_chapter) || (ch == (int16_t)menu_sel);

            uint16_t tile_bg = sel ? sel_bg() : bg();
            tft.fillRect(x, y, tile_w, tile_h, tile_bg);
            tft.drawRect(x, y, tile_w, tile_h, dark_mode ? 0x2104 : 0xC618);

            char buf[5];
            snprintf(buf, sizeof(buf), "%d", ch);
            tft.setTextColor(fg(), tile_bg);
            tft.drawCentreString(buf, x + tile_w / 2, y + (tile_h - 16) / 2, 2);
        }
    }

