H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
void BibleInterface::selectTranslation(uint16_t idx) {
    if (idx >= trans_count) idx = 0;
    cur_trans = (uint8_t)idx;
    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
    book_idx_valid = false;

    if (mode != MODE_BIBLE) {
        if (!loadToc(trans_stems[cur_trans])) {
            // Structure file missing/unreadable — tell the user which file, then
            // wait for a tap (rather than silently bouncing to the menu).
            tft.fillScreen(bg());
            drawHeader("ESP-32 Library", false);
            tft.setTextColor(TFT_RED, bg());
            char msg[72];
            snprintf(msg, sizeof(msg), "%s/%s.toc", basePath(), trans_stems[cur_trans]);
            tft.drawCentreString(msg, scrW() / 2, scrH() / 2 - 24, 2);
            tft.setTextColor(dim_fg(), bg());
            char reason[64];
            snprintf(reason, sizeof(reason), "TOC error: %s", g_toc_err[0] ? g_toc_err : "unknown");
            tft.drawCentreString(reason, scrW() / 2, scrH() / 2 - 2, 2);
            tft.drawCentreString("Copy the .toc next to the .xml", scrW() / 2, scrH() / 2 + 20, 2);
            tft.drawCentreString("Tap to go back", scrW() / 2, scrH() / 2 + 42, 2);
            mode = MODE_BIBLE;
            view = BV_MAIN_MENU;
            needs_redraw = false;
            return;
        }
        if (cur_book >= numBooks()) cur_book = 0;
        cur_sec = (numBooks() > 0) ? bookSection(cur_book) : 0;
        if (cur_chapter == 0 || cur_chapter > bookChapters(cur_book)) cur_chapter = 1;
    } else {
        // Bible: ensure the byte-offset buffer exists (filled lazily from the .idx
        // file inside cacheChapter). loadToc() handles this for Songs/Dict.
        if (!book_offsets || book_offsets_cap < BIBLE_BOOK_COUNT) {
            if (book_offsets) free(book_offsets);
            book_offsets     = (uint32_t*)RT_MALLOC(sizeof(uint32_t) * BIBLE_BOOK_COUNT);
            book_offsets_cap = book_offsets ? BIBLE_BOOK_COUNT : 0;
        }
        if (book_offsets) memset(book_offsets, 0, sizeof(uint32_t) * BIBLE_BOOK_COUNT);
        if (cur_book >= numBooks()) cur_book = 0;
        cur_sec = bookSection(cur_book);
    }
    saveState();
    goToSection();
}

void BibleInterface::goBack() {
    stopFling();
    switch (view) {
        case BV_MAIN_MENU:       /* already root */ break;
        case BV_TRANS_SELECT:    goToMainMenu(); break;
        case BV_SECTION_SELECT:
            if (trans_count > 1) goToTransSelect();
            else                 goToMainMenu();
            break;
        case BV_BOOK_SELECT:
            if      (numSecs() > 1)    goToSection();
            else if (trans_count > 1)  goToTransSelect();
            else                       goToMainMenu();
            break;
        case BV_CHAPTER_SELECT:  goToBook(bookSection(cur_book)); break;
        case BV_READING:
            if (reading_from_search) {
                reading_from_search = false;
                highlight_verse     = 0;
                view      = BV_SEARCH_RESULTS;
                scroll_px = (float)menu_scroll * (float)srchH();
                needs_redraw = true;
            } else if (bookChapters(cur_book) <= 1) {
                // Single-chapter book (Song): chapter grid is skipped, so go to
                // the book (song) list rather than back into the reader.
                goToBook(bookSection(cur_book));
            } else {
                goToChapter(cur_book);
            }
            break;
        case BV_SETTINGS:
        case BV_BOOKMARKS:
            bm_confirm_pending = false;
            if (cached_count > 0) {
                view = BV_READING;
                scroll_px = (float)read_line * (float)lineH();
                needs_redraw = true;
            } else {
                goToSection();
            }
            break;
        case BV_SEARCH_RESULTS:
            goToSearchInput();
            break;
        case BV_SEARCH_INPUT:
            search_del_pending = false;
            if (cached_count > 0) {
                view = BV_READING;
                scroll_px = (float)read_line * (float)lineH();
                needs_redraw = true;
            } else {
                goToSection();
            }
            break;
    }
}
void BibleInterface::addBookmarkCurrent() {
    BibleBookmark bm;
    bm.book        = cur_book;
    bm.chapter     = cur_chapter;
    bm.verse_first = sel_verse_first;
    bm.verse_last  = sel_verse_last;
    bm.trans       = cur_trans;   // used by Songs/Dict (book index is per-file)

    if (sel_verse_first > 0) {
        // Verse / range bookmark. Songs are single-chapter, so drop the chapter
        // number (e.g. "Title  v3" instead of "Title 1:3").
        if (mode == MODE_DICT) {
            // Label with the entry's headword (text before " - ").
            char w[40]; w[0] = 0;
            if (cached_book == cur_book && cached_chap == cur_chapter &&
                sel_verse_first >= 1 && sel_verse_first <= cached_count) {
                const char* s    = verse_buf[sel_verse_first - 1];
                const char* dash = strstr(s, " - ");
                size_t len = dash ? (size_t)(dash - s) : strlen(s);
                if (len > sizeof(w) - 1) len = sizeof(w) - 1;
                memcpy(w, s, len); w[len] = 0;
            }
            if (w[0]) snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s", w);
            else      snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s p%d:%d",
                               bookDisplay(cur_book), cur_chapter, sel_verse_first);
        } else if (mode == MODE_SONGS) {
            if (sel_verse_first == sel_verse_last)
                snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s  v%d",
                         bookDisplay(cur_book), sel_verse_first);
            else
                snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s  v%d-%d",
                         bookDisplay(cur_book), sel_verse_first, sel_verse_last);
        } else if (sel_verse_first == sel_verse_last)
            snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s %d:%d",
                     bookDisplay(cur_book), cur_chapter, sel_verse_first);
        else
            snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s %d:%d-%d",
                     bookDisplay(cur_book), cur_chapter,
                     sel_verse_first, sel_verse_last);
        // Reject exact duplicates (same book/chapter/verse range)
        for (uint8_t i = 0; i < bm_count; i++) {
            if (bookmarks[i].book == cur_book && bookmarks[i].chapter == cur_chapter
                    && bookmarks[i].verse_first == sel_verse_first
                    && bookmarks[i].verse_last  == sel_verse_last
                    && (mode == MODE_BIBLE || bookmarks[i].trans == cur_trans)) {
                tft.fillRect(scrW()/2, scrH() - navH() - 18, scrW()/2, 16, (uint16_t)0xFD20);
                tft.setTextColor(TFT_BLACK, (uint16_t)0xFD20);
                tft.drawCentreString("Already saved", 3*scrW()/4, scrH() - navH() - 18, 1);
                delay(600);
                needs_redraw = true;
                return;
            }
        }
    } else {
        // Whole-chapter bookmark (songs: just the title; dict: the page word pair).
        if (mode == MODE_SONGS) {
            snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s", bookDisplay(cur_book));
        } else if (mode == MODE_DICT) {
            const char* pl = pageLabel(cur_chapter - 1);
            if (pl && pl[0]) snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s", pl);
            else             snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s p%d",
                                      bookDisplay(cur_book), cur_chapter);
        } else {
            snprintf(bm.label, BIBLE_BM_LABEL_LEN, "%s %d",
                     bookDisplay(cur_book), cur_chapter);
        }
        for (uint8_t i = 0; i < bm_count; i++) {
            if (bookmarks[i].book == cur_book && bookmarks[i].chapter == cur_chapter
                    && bookmarks[i].verse_first == 0
                    && (mode == MODE_BIBLE || bookmarks[i].trans == cur_trans)) {
                tft.fillRect(scrW()/2, scrH() - navH() - 18, scrW()/2, 16, (uint16_t)0xFD20);
                tft.setTextColor(TFT_BLACK, (uint16_t)0xFD20);
                tft.drawCentreString("Already saved", 3*scrW()/4, scrH() - navH() - 18, 1);
                delay(600);
                needs_redraw = true;
                return;
            }
        }
    }

    if (bm_count >= BIBLE_MAX_BM) return;
    bookmarks[bm_count++] = bm;
    saveBookmarks();

    // Clear verse selection after saving
    sel_verse_first = sel_verse_last = 0;

