H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
        for (int t = 0; t < ntokens && !found; t++) {
            const char* tok = tokens[t].s;
            size_t      tl  = tokens[t].len;
            if (tl == 0) continue;

            if (srch_ignore_punct) {
                // Skip punct in disp while consuming token chars
                size_t qi = 0, di = si;
                while (qi < tl) {
                    while (disp[di] && (uint8_t)disp[di] < 0x80 && ispunct((int)(uint8_t)disp[di]))
                        di++;
                    if (!disp[di]) break;
                    if (tolower((uint8_t)disp[di]) != tolower((uint8_t)tok[qi])) break;
                    di++; qi++;
                }
                if (qi == tl) { found = true; match_end = di; }
            } else {
                bool m = true;
                for (size_t j = 0; j < tl && m; j++) {
                    if (!disp[si + j] ||
                        tolower((uint8_t)disp[si + j]) != tolower((uint8_t)tok[j]))
                        m = false;
                }
                if (m) { found = true; match_end = si + tl; }
            }
        }

        if (found) {
            tft.setTextColor((uint16_t)0xFD20, bg_col);
            for (size_t j = si; j < match_end && sx < max_sx; j++)
                sx += tftCharUTF8(tft, (uint8_t)snip[j], sx, snip_y, 1, (uint16_t)0xFD20);
            si = match_end;
        } else {
            uint16_t text_color = sel ? fg() : dim_fg();
            tft.setTextColor(text_color, bg_col);
            sx += tftCharUTF8(tft, (uint8_t)snip[si], sx, snip_y, 1, text_color);
            si++;
        }
    }
}

// Partial redraw of search result list (no header/nav repaint).
// Uses scroll_px for sub-row pixel accuracy and a viewport to clip rows.
void BibleInterface::redrawSearchResultsContent() {
    int16_t sub_px    = (int16_t)fmodf(scroll_px, (float)srchH());
    int16_t first     = (int16_t)(scroll_px / (float)srchH());
    int16_t cTop      = (int16_t)contentY();
    int16_t cEnd      = cTop + (int16_t)contentH();

    tft.startWrite();
    tft.setViewport(0, cTop, scrW(), contentH(), false);

    // Draw each visible row (each fills its own background — no upfront clear,
    // which would cause a white/black flash between frames).
    int16_t last_bottom = cTop;
    for (int i = 0; ; i++) {
        int16_t idx = first + i;
        int16_t y   = cTop - sub_px + i * (int16_t)srchH();
        if (y >= cEnd || idx >= (int16_t)search_result_count) break;
        drawSearchResultRow(y, (uint16_t)idx, idx == search_res_sel);
        int16_t bot = y + (int16_t)srchH();
        if (bot > last_bottom) last_bottom = bot;
    }
    // Clear any unused space below the last row (list shorter than content zone)
    if (last_bottom < cEnd)
        tft.fillRect(0, last_bottom, (int16_t)scrW() - 6, cEnd - last_bottom, bg());

    drawScrollBar(search_result_count, visSearchItems(), first);
    tft.resetViewport();
    tft.endWrite();
}

void BibleInterface::drawSearchResults() {
    tft.fillScreen(bg());
    char hdr[32];
    if (search_result_count >= BIBLE_MAX_SEARCH_RESULTS)
        snprintf(hdr, sizeof(hdr), "%d+ Results", BIBLE_MAX_SEARCH_RESULTS);
    else
        snprintf(hdr, sizeof(hdr), "%d Results", (int)search_result_count);
    drawHeader(hdr, true);

    if (search_result_count == 0) {
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString("No matches found", scrW() / 2, contentY() + 30, 2);
        drawNavBar("Back", "", "");
        return;
    }

    uint8_t vis = visSearchItems();
    for (uint8_t i = 0; i < vis && (menu_scroll + i) < search_result_count; i++) {
        uint16_t idx = menu_scroll + i;
        drawSearchResultRow((int16_t)(contentY() + i * srchH()), idx,
                            idx == (uint16_t)search_res_sel);
    }
    drawScrollBar(search_result_count, vis, menu_scroll);
    drawNavBar("Back", "", "View");
}

// Progress bar drawn during searchBible() — called ~every 8 KB of XML read.
// The border is drawn only on the first call (done==0) to avoid repainting gray
// over the bar interior on every update, which caused a strobing gray flash.
// Small live "DRAM: NN%  PSRAM: NN%" readout (used% of each pool), centred at y.
void BibleInterface::drawMemUsage(int16_t y) {
    uint32_t dtot = ESP.getHeapSize();
    uint32_t dfree = ESP.getFreeHeap();
    int dpct = (dtot > 0) ? (int)(100UL * (dtot - dfree) / dtot) : 0;

    char buf[40];
#ifdef HAS_PSRAM
    uint32_t ptot = ESP.getPsramSize();
    uint32_t pfree = ESP.getFreePsram();
    int ppct = (ptot > 0) ? (int)(100UL * (ptot - pfree) / ptot) : 0;
    if (ptot > 0) snprintf(buf, sizeof(buf), "D-RAM: %d%%   PSRAM: %d%%", dpct, ppct);
    else          snprintf(buf, sizeof(buf), "D-RAM: %d%%   PSRAM: n/a", dpct);
#else
    snprintf(buf, sizeof(buf), "D-RAM: %d%%", dpct);
#endif
    // Repaint a clean strip so the value updates in place without ghosting.
    tft.fillRect(0, y, scrW(), 10, bg());
    tft.setTextColor(dim_fg(), bg());
    tft.drawCentreString(buf, scrW() / 2, y, 1);
}

void BibleInterface::drawSearchProgress(uint32_t done, uint32_t total) {
    int16_t bar_x = 10;
    int16_t bar_y = (int16_t)(contentY() + contentH() / 2 + 8);
    int16_t bar_w = (int16_t)scrW() - 20;
    int16_t bar_h = 14;

    // Draw border + empty interior only once at the start
    if (done == 0) {
        tft.fillRect(bar_x - 1, bar_y - 1, bar_w + 2, bar_h + 2, dim_fg());
        tft.fillRect(bar_x, bar_y, bar_w, bar_h, bg());
    }

    // Fill from left: green up to `filled`, then bg() for the remainder.
    // Drawing in this order avoids a full-bar clear that would flash the background.
    int16_t filled = 0;
    if (total > 0) {
        filled = (int16_t)((uint32_t)bar_w * done / total);
        if (filled > bar_w) filled = bar_w;
        if (filled > 0)
            tft.fillRect(bar_x, bar_y, filled, bar_h, (uint16_t)0x07E0);
    }
    if (filled < bar_w)
        tft.fillRect(bar_x + filled, bar_y, bar_w - filled, bar_h, bg());

    char pct[12];
    if (total > 0)
        snprintf(pct, sizeof(pct), "%d%%", (int)(100UL * done / total));
    else
        snprintf(pct, sizeof(pct), "...");
    tft.setTextColor(fg(), bg());
    tft.drawCentreString(pct, scrW() / 2, bar_y + bar_h + 2, 1);

